using System;

namespace Task3
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Используя Visual Studio, создайте проект по шаблону Console Application.  
                Напишите программу определения, попадает ли указанное пользователем число от 0 до 100
                в числовой промежуток [0 - 14] [15 - 35] [36 - 50][50 - 100].
                Если да, то укажите, в какой именно промежуток.
                Если пользователь указывает число, не входящее ни в один из имеющихся числовых промежутков,
                то выводится соответствующее сообщение. 
            */

            int num;
            
          //  string result;

            Console.WriteLine("Enter any number from 0 to 100 to check interval");

          //  if (num=Convert.ToInt16(Console.ReadLine()) {

            }
          

            Console.WriteLine(num);
            Console.ReadKey();
                        
           




        }
    }
}
